# 数据分析工具


钉钉群

1，用来提问，欢迎互相帮助

2，https://space.bilibili.com/362734486

到课率，作业，随堂测验，期末考试（上机/试卷）

重修

## 数据分析工具的选择:
    
### 易用性：

* 流行的数据分析软件: "Tableau" "power BI" "FineReport Designer" "spss" "Finebi"

### 不那么易用:编程语言: python or R

* 更强大，更灵活

数据分析与就业

如果你目标是企业的数据分析师，建议要会用一种流行的数据分析软件，python作为备用，在你需要创新的时候可能需要

如果是科研，必须python

概念是互通的，并不难

# python 的安装

* anaconda（群里下载）

* https://www.cnblogs.com/MrZhangxd/p/10726791.html

百度有不少教程，暂时可以不用管环境变量的设置

# 参考书

* pandas-document

* cheat-sheet

# 数据结构与切片

##  python 基本语法

* 变量与变量名

* 变量类型与运算

* 基础数据结构：list/dict

* 包的导入与函数的使用

In [1]:
a=5
print(a)

5

In [32]:
abc=3
a1=0
a22ce=4

In [2]:
a=4.6
b="aaa"#single quotes or double quotes
c=False
d=True
print(a,b,c,d)

4.6 aaa False True

In [30]:
3>4

False

In [4]:
a=2
b=3
print(a-b,a+b,a*b,a/b,a**b,5+4,8.2/4)

-1 5 6 0.6666666666666666 8 9 2.05

* 列表与字典

* The best way to think of these data structures is that the higher dimensional data structure is a container of its lower dimensional data structure. For example, DataFrame is a container of Series, Panel is a container of DataFrame.

https://www.tutorialspoint.com/python_pandas/python_pandas_introduction_to_data_structures.htm

* 复杂的数据结构本质上市简单数据类型的容器。

In [9]:
a=[1,2,3,1,6,"a",0.4]
print(a[0],a[3],a[1:3])

1 1 [2, 3]

In [24]:
#key and value
b={2:4,4:7,"a":0}
print(b[2],b["a"])

4 0

In [27]:
b.keys()

dict_keys([2, 4, 'a'])

In [28]:
b.values()

dict_values([4, 7, 0])

## classwork 1

In [2]:
a=[1,3,5,8,2,6,3,9]

In [44]:
a[0]

1

In [45]:
a[2:5]

[5, 8, 2]

In [46]:
a[7]

9

In [53]:
d={2:5,4:1,"a":3,9:[7,8]}#print the result base on a

In [48]:
d[4]

1

In [49]:
d["a"]

3

In [50]:
d[9]

[7, 8]

In [51]:
d[9][0]

7

## pandas的导入

* 序列series的定义

* pandas的材料：

1 百度；2 官网文档（群里下载）；

3 https://www.tutorialspoint.com/python_pandas/python_pandas_introduction_to_data_structures.htm



* more ways of creating a series:  https://www.tutorialspoint.com/python_pandas/python_pandas_series.htm

In [1]:
import pandas as pd

In [2]:
pd.__version__# the current version

'1.1.1'

In [66]:
c={"i":2,"u":3,3:6}
a=pd.Series(c)# creat a series by dict
print(a)

i    2
u    3
3    6
dtype: int64

In [27]:
a["i"]# the same way as dict

2

In [16]:
a.loc["i"]

2

In [67]:
a[["i",3]]

i    2
3    6
dtype: int64

In [68]:
a.iloc[1]# select by order

3

In [18]:
a.iloc[1:3]

u    3
3    6
dtype: int64

In [15]:
a.values

array([2, 3, 6], dtype=int64)

In [16]:
a.index

Index(['i', 'u', 3], dtype='object')

## classwork 2

In [58]:
d1={2:4,5:6,"a":1}

In [61]:
#create a series by d1,and assgin it to a variable

2    4
5    6
a    1
dtype: int64

In [62]:
# select 4 by this series

4

In [63]:
# print all index

Index([2, 5, 'a'], dtype='object')

In [64]:
# print all values

array([4, 6, 1], dtype=int64)

2    4
a    1
dtype: int64

In [72]:
c1.iloc[0:2]

2    4
5    6
dtype: int64

# 数据框是由多个序列构成的


* DataFrame as a container of Series

* more ways of creating a series:  https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm

* select by index()

In [6]:
#The following example shows how to create a DataFrame with a list of dictionaries
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42],"Weight":[98,88,106,120]}# creat a DataFrame by dict
df = pd.DataFrame(data)
print(df)

    Name  Age  Weight
0    Tom   28      98
1   Jack   34      88
2  Steve   29     106
3  Ricky   42     120

* 数据框的三个部分

In [23]:
# three parts 
df.values

array([['Tom', 28, 98],
       ['Jack', 34, 88],
       ['Steve', 29, 106],
       ['Ricky', 42, 120]], dtype=object)

In [19]:
df.columns

Index(['Name', 'Age', 'Weight'], dtype='object')

In [22]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [60]:
df["Name"]# select one column by index

0      Tom
1     Jack
2    Steve
3    Ricky
Name: Name, dtype: object

In [96]:
df.Name#simplified form

0      Tom
1     Jack
2    Steve
3    Ricky
Name: Name, dtype: object

In [61]:
df.loc[0]# select one row by index

Name      Tom
Age        28
Weight     98
Name: 0, dtype: object

In [35]:
df[["Name","Weight"]]# the type is DataFrame;don't forget the brackets/col name is often discrete

    Name  Weight
0    Tom      98
1   Jack      88
2  Steve     106
3  Ricky     120

In [62]:
df.loc[0:3]# selet by range

    Name  Age  Weight
0    Tom   28      98
1   Jack   34      88
2  Steve   29     106
3  Ricky   42     120

In [63]:
df.loc[[0,3],["Name","Weight"]]# select by index/discrete

    Name  Weight
0    Tom      98
3  Ricky     120

In [7]:
# combine
df.loc[0:3][["Name","Weight"]]
# 链式调研，只要是对应类型，就能继续使用对应类型的函数，

    Name  Weight
0    Tom      98
1   Jack      88
2  Steve     106
3  Ricky     120

In [11]:
#iloc是基于顺序进行选择，必要的时候请自学

## classwork3

In [73]:
c={"a":[2,3,4,7],"b":[2,5,6,9],"c":[8,1,5,0]}

In [74]:
#create DataFrame by the variable c

   a  b  c
0  2  2  8
1  3  5  1
2  4  6  5
3  7  9  0

In [76]:
#print the result below by this dataframe

0    2
1    3
2    4
3    7
Name: a, dtype: int64

   a  c
0  2  8
1  3  1
2  4  5
3  7  0

a    3
b    5
c    1
Name: 1, dtype: int64

   a  b  c
0  2  2  8
1  3  5  1

8

## 数据文件的读取与切片

* 数据文件t_alibaba_data3.txt 来源于2014阿里天池数据竞赛。为天猫14年某月用户消费行为记录抽样。第一列为用户号，第二列为品牌号，第三列为记录类型(浏览：0 购买：1 收藏：2 购物车：3）,四列为时间

In [28]:
r1=pd.read_csv(r"D:\t_alibaba_data3.txt",names=["user","brand","behavr","date"],sep="\t")

In [4]:
r1.head()#select the top 5 rows

       user  brand  behavr   date
0  10944750  13451       0  06/04
1  10944750  13451       2  06/04
2  10944750  13451       2  06/04
3  10944750  13451       0  06/04
4  10944750  13451       0  06/04

In [12]:
r1["user"]

0         10944750
1         10944750
2         10944750
3         10944750
4         10944750
            ...
182875      847750
182876      847750
182877      847750
182878      847750
182879      847750
Name: user, Length: 182880, dtype: int64

In [13]:
r1[["user","date"]]

            user   date
0       10944750  06/04
1       10944750  06/04
2       10944750  06/04
3       10944750  06/04
4       10944750  06/04
...          ...    ...
182875    847750  07/30
182876    847750  07/30
182877    847750  08/12
182878    847750  08/08
182879    847750  08/08

[182880 rows x 2 columns]

In [7]:
r1.loc[2]

user      10944750
brand        13451
behavr           2
date         06/04
Name: 2, dtype: object

In [8]:
r1.loc[2:6]

       user  brand  behavr   date
2  10944750  13451       2  06/04
3  10944750  13451       0  06/04
4  10944750  13451       0  06/04
5  10944750  13451       0  06/04
6  10944750  13451       0  06/04

In [10]:
r1.loc[2:6,["user","brand"]]

       user  brand
2  10944750  13451
3  10944750  13451
4  10944750  13451
5  10944750  13451
6  10944750  13451

## classwork4

In [85]:
# download the data file named t_alibaba_data3.txt, read it by python and print the top6 rows

       user  brand  behavr   date
0  10944750  13451       0  06/04
1  10944750  13451       2  06/04
2  10944750  13451       2  06/04
3  10944750  13451       0  06/04
4  10944750  13451       0  06/04
5  10944750  13451       0  06/04

0         06/04
1         06/04
2         06/04
3         06/04
4         06/04
          ...
182875    07/30
182876    07/30
182877    08/12
182878    08/08
182879    08/08
Name: date, Length: 182880, dtype: object

user      10944750
brand        13451
behavr           0
date         06/04
Name: 0, dtype: object

       user  brand  behavr   date
2  10944750  13451       2  06/04
3  10944750  13451       0  06/04
4  10944750  13451       0  06/04

2    06/04
3    06/04
4    06/04
Name: date, dtype: object

       user  behavr
2  10944750       2
5  10944750       0

## 数据框的比较过滤

* 比较都是以列为基础的
* 大于小于，与或非，等于也是==

In [52]:
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42],"Weight":[98,88,106,120]}# creat a DataFrame by dict
df = pd.DataFrame(data)
print(df)

    Name  Age  Weight
0    Tom   28      98
1   Jack   34      88
2  Steve   29     106
3  Ricky   42     120

In [25]:
df.Age==29

0    False
1    False
2     True
3    False
Name: Age, dtype: bool

In [27]:
df[df.Age==29]

    Name  Age  Weight
2  Steve   29     106

In [19]:
df[["Age","Weight"]]>90

     Age  Weight
0  False    True
1  False   False
2  False    True
3  False    True

In [20]:
df[df[["Age","Weight"]]>90]

  Name  Age  Weight
0  NaN  NaN    98.0
1  NaN  NaN     NaN
2  NaN  NaN   106.0
3  NaN  NaN   120.0

In [21]:
(df.Age>30)&(df.Weight>100)

0    False
1    False
2    False
3     True
dtype: bool

In [22]:
df[(df.Age>30)&(df.Weight>100)]

    Name  Age  Weight
3  Ricky   42     120

In [23]:
df[(df.Age>30)|(df.Weight>100)]

    Name  Age  Weight
1   Jack   34      88
2  Steve   29     106
3  Ricky   42     120

## classwork 5

In [29]:
#导入t_alibaba_data3数据

       user  brand  behavr   date
0  10944750  13451       0  06/04
1  10944750  13451       2  06/04
2  10944750  13451       2  06/04
3  10944750  13451       0  06/04
4  10944750  13451       0  06/04

In [30]:
#输出所有收藏记录

            user  brand  behavr   date
1       10944750  13451       2  06/04
2       10944750  13451       2  06/04
10      10944750   8689       2  05/02
11      10944750   8689       2  05/02
80      10944750  25687       2  05/08
...          ...    ...     ...    ...
182070  10312750  15934       2  08/15
182071  10312750  15934       2  08/15
182076  10312750   2899       2  08/11
182140  10312750   5185       2  08/15
182545    236000   9452       2  07/30

[1204 rows x 4 columns]

In [31]:
#选择所有5月1日之后的记录

            user  brand  behavr   date
0       10944750  13451       0  06/04
1       10944750  13451       2  06/04
2       10944750  13451       2  06/04
3       10944750  13451       0  06/04
4       10944750  13451       0  06/04
...          ...    ...     ...    ...
182875    847750  26631       0  07/30
182876    847750  26631       0  07/30
182877    847750   2845       0  08/12
182878    847750   5317       0  08/08
182879    847750  22353       0  08/08

[162540 rows x 4 columns]

In [32]:
#选择所有5月份的记录

            user  brand  behavr   date
9       10944750   8689       0  05/02
10      10944750   8689       2  05/02
11      10944750   8689       2  05/02
12      10944750   8689       0  05/02
13      10944750   8689       0  05/02
...          ...    ...     ...    ...
131698    847750   1261       0  05/16
131700    847750  12220       0  05/10
131701    847750  12220       0  05/10
131702    847750  12220       0  05/10
131703    847750  12220       0  05/10

[39565 rows x 4 columns]

In [50]:
#输出用户10944750在哪些天浏览了商品？

['04/18', '04/24', '05/01', '05/02', '05/08', '05/15', '05/16', '05/17', '05/20', '05/24', '05/30', '06/01', '06/04', '06/06', '06/07', '06/09', '06/10', '06/11', '06/14', '06/15', '06/19', '06/23', '06/24', '06/28', '07/02', '07/03', '07/04', '07/05', '07/07', '07/08', '07/09', '07/10', '07/12', '07/13', '07/22', '07/23', '07/25', '07/26', '07/28', '07/31', '08/06', '08/07', '08/08', '08/09', '08/10', '08/13', '08/15']